In [1]:
import os
os.getcwd()

import pandas as pd
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})
df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df.head()
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [6]:
df.loc['Store 2']

Name                  Vinod
Item Purchased    Bird Seed
Cost                      5
Name: Store 2, dtype: object

In [3]:
purchase_1 = pd.Series({'Name': 'Chris',
                        'Item Purchased': 'Dog Food',
                        'Cost': 22.50})
purchase_2 = pd.Series({'Name': 'Kevyn',
                        'Item Purchased': 'Kitty Litter',
                        'Cost': 2.50})
purchase_3 = pd.Series({'Name': 'Vinod',
                        'Item Purchased': 'Bird Seed',
                        'Cost': 5.00})

df = pd.DataFrame([purchase_1, purchase_2, purchase_3], index=['Store 1', 'Store 1', 'Store 2'])
df

          Name Item Purchased  Cost
Store 1  Chris       Dog Food  22.5
Store 1  Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [19]:
df = df.set_index([df.index, 'Name'])
df
df.index.names = ['Location', 'Name']
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0

In [20]:

df = df.append(pd.Series(data={'Cost': 3.00, 'Item Purchased': 'Kitty Food'}, name=('Store 2', 'Kevyn')))
df

               Item Purchased  Cost
Location Name
Store 1  Chris       Dog Food  22.5
         Kevyn   Kitty Litter   2.5
Store 2  Vinod      Bird Seed   5.0
         Kevyn     Kitty Food   3.0

In [1]:
import pandas as pd

df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                   {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                   {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                  index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [3]:
df.reset_index()

     index  Cost Item Purchased   Name
0  Store 1  22.5         Sponge  Chris
1  Store 1   2.5   Kitty Litter  Kevyn
2  Store 2   5.0          Spoon  Filip

# Merging dataframes : intersection(inner) & union(outer)

In [4]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course liasion'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')
student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')
print(staff_df.head())
print()
print(student_df.head())

                 Role
Name
Kelly  Director of HR
Sally  Course liasion
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [6]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally  Course liasion  Engineering

In [13]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                 Role       School
Name
Sally  Course liasion  Engineering
James          Grader     Business

In [14]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally  Course liasion  Engineering
James          Grader     Business

In [15]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Mike              NaN          Law
Sally  Course liasion  Engineering

In [16]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally  Course liasion  Engineering
2  James          Grader     Business

In [53]:
products=pd.DataFrame([{'ProductID': '4109', 'Price': '5','Product':'Sushi Roll'},  
                       {'ProductID': '1412', 'Price': '0.5','Product':'Egg'},
                        {'ProductID': '8931', 'Price': '1.5','Product':'Bagel'}])
products             
# products.set_index('ProductID')

# invoices=pd.DataFrame([{'Customer': 'Ali', 'ProductID': '4109','Quantity':'1'},  
#                        {'Customer': 'Eric', 'ProductID': '1412','Quantity':'12'}, 
#                        {'Customer': 'Ande', 'ProductID': '8931','Quantity':'6'}, 
#                        {'Customer': 'Sam', 'ProductID': '4109','Quantity':'2'}])
# invoices
#invoices.set_index('ProductID')
#pd.merge(products,invoices,left_index=True,right_on='ProductID')

# print(pd.merge(products, invoices, left_index=True, right_on='ProductID'))

  Price     Product ProductID
0     5  Sushi Roll      4109
1   0.5         Egg      1412
2   1.5       Bagel      8931

In [51]:
invoices=pd.DataFrame([{'Customer': 'Ali', 'ProductID': '4109','Quantity':'1'},  
                       {'Customer': 'Eric', 'ProductID': '1412','Quantity':'12'}, 
                       {'Customer': 'Ande', 'ProductID': '8931','Quantity':'6'}, 
                       {'Customer': 'Sam', 'ProductID': '4109','Quantity':'2'}])
invoices
# print(pd.merge(products, invoices, how='outer',left_index=True, right_index=True))

  Customer ProductID Quantity
0      Ali      4109        1
1     Eric      1412       12
2     Ande      8931        6
3      Sam      4109        2

In [54]:
print(pd.merge(products, invoices, left_on='ProductID', right_on='ProductID'))

  Price     Product ProductID Customer Quantity
0     5  Sushi Roll      4109      Ali        1
1     5  Sushi Roll      4109      Sam        2
2   0.5         Egg      1412     Eric       12
3   1.5       Bagel      8931     Ande        6